* GPL-3 Licence
#+TITLE: Unit Tests & Examples for Orgtbl Fit
Copyright (C) 2014-2024  Thierry Banel

orgtbl-fit is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

orgtbl-fit is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.

* Recipe to run unit tests
To run unit tests:
- Execute the following Lisp block by typing ~C-c C-c~ in it.
- Look at the differences between this reference unittests.org file
  and the disposable buffer.
  The first difference is where the cursor is.
- If all tests were successful, the cursor is at the end of the file.

#+begin_src elisp :results none
(delete-other-windows)
(goto-char (point-min))
(org-cycle '(64))
(split-window-right)

;; Make a new buffer and fill it with the content of unittests.org

(let ((f (buffer-file-name)))
  (switch-to-buffer "disposable-unittest.org")
  (erase-buffer)
  (insert-file f))

(org-mode)
(org-cycle '(64))

;; Iterate over each unit test
(let (model c)
  (while
      (and
       (search-forward-regexp
	(rx bol "model" (* space) "=" (* space) (group (+ nonl)))
	(point-max)
	t)
       (setq model (match-string 1))
       (search-forward "-(v)" (point-max) t))

    ;; Get the column containing observations to predict
    (setq c (current-column))

    ;; Remove last two columns from a previous fitting
    (forward-line 1)
    (end-of-line)
    (org-shiftmetaleft)
    (org-shiftmetaleft)

    ;; Remove the formula from a previous fitting
    (search-forward "#+TBLFM:")
    (beginning-of-line)
    (kill-line)
    (kill-line)

    ;; Put the cursor on the observations column
    (forward-line -1)
    (move-to-column (- c 2))

    ;; And last but not least, compute the best fitting
    (orgtbl-fit model)))

;; Compare the disposable buffer with the reference unittests.org
(goto-char (point-min))
(compare-windows nil)

#+end_src

* Straightforward example

model = ? +?*$1
------(v)
| 1 | 13 | 13. | 0. |
| 2 | 23 | 23. | 0. |
| 3 | 33 | 33. | 0. |
| 4 | 43 | 43. | 0. |
| 5 | 53 | 53. | 0. |
#+TBLFM: $3=3. + 10.*$1::$4=$3-$2

* Simple example

model = ? +?*x +?*y +?*z
--------------(v)
| x | y | z | cost |  Best Fit |  Fit Diff |
|---+---+---+------+-----------+-----------|
| 1 | 5 | 1 |   12 | 12.049653 |  0.049653 |
| 2 | 2 | 5 |   15 | 14.904373 | -0.095627 |
| 3 | 9 | 9 |   21 | 21.012873 |  0.012873 |
| 4 | 1 | 5 |   30 | 30.062526 |  0.062526 |
| 5 | 8 | 0 |   45 | 44.970576 | -0.029424 |
#+TBLFM: $5=3.65872496935 + 7.74176542705*$1 + 0.325378013895*$2 - 0.977727829996*$3::$6=$5-$4

* Same table, but fit a different target column

model = ? +?*x +?*z +?*cost
-----(v)
| x | y | z | cost |   Best Fit |   Fit Diff |
|---+---+---+------+------------+------------|
| 1 | 5 | 1 |   12 |  4.8441828 | -0.1558172 |
| 2 | 2 | 5 |   15 |  2.3012465 |  0.3012465 |
| 3 | 9 | 9 |   21 |  8.9480609 | -0.0519391 |
| 4 | 1 | 5 |   30 | 0.82340720 | -0.1765928 |
| 5 | 8 | 0 |   45 |  8.0831025 |  0.0831025 |
#+TBLFM: $5=-11.1966759002 - 23.7132963987*$1 + 2.99515235455*$3 + 3.06325023082*$4::$6=$5-$2

* Luxurious header

model = ? +?*yme +?*sogd
----------------------(v)
|-------+---------+---------+------------+-----------|
|-------+---------+---------+------------+-----------|
| yèm:e | so gôöd | Fùb-t:ŭ |   Best Fit |  Fit Diff |
|   oFf |   --ĥ-- |    (45) |            |           |
|-------+---------+---------+------------+-----------|
|     5 |     5.6 |    19.3 |  19.461004 |  0.161004 |
|     9 |     7.1 |    38.1 |  37.781581 | -0.318419 |
|     3 |     1.0 |    14.4 |  14.396845 | -3.155e-3 |
|    22 |     7.4 |   102.1 |  102.19094 |   0.09094 |
|     1 |     9.9 |    -5.1 | -5.0303653 | 0.0696347 |
|-------+---------+---------+------------+-----------|
#+TBLFM: $4=0.523420429171 + 4.97911793339*$1 - 1.06392966069*$2::$5=$4-$3

* Example of portable PCs
Here are some PC with their public prices and technical features

| Brand | Screen | CPU   | OS | Mem Gb | Price |
|-------+--------+-------+----+--------+-------|
| AAA   | 17.3"  | i7 HQ | W  |      4 |   699 |
| BBB   | 17.3"  | i7 HQ | W  |      6 |   749 |
| CCC   | 17.3"  | i5 H  | F  |      4 |   669 |
| DDD   | 17.3"  | i5 U  | W  |      6 |   645 |
| EEE   | 17.3"  | i5 M  | W  |      4 |   669 |
| GGG   | 15.6"  | i7 U  | W  |      8 |   729 |
| HHH   | 15.6"  | i7 U  | W  |      8 |   679 |
| III   | 15.6"  | i7 U  | W  |      8 |   799 |
| JJJ   | 15.6"  | i7 HQ | F  |      4 |   699 |
| KKK   | 15.6"  | i5 U  | W  |     16 |   699 |

Can we predict the price depending on components ?
We put this table in a numerical form as this:

model = ? +?*S173 +?*i7 +?*OS +?*Mem
----------------------------------(v)
| Brand | S173 | i7 | OS | Mem | Price |  Best Fit |  Fit Diff |
|-------+------+----+----+-----+-------+-----------+-----------|
| AAA   |    1 |  1 |  1 |   4 |   699 | 721.55589 |  22.55589 |
| BBB   |    1 |  1 |  1 |   6 |   749 | 731.70091 | -17.29909 |
| CCC   |    1 |  0 |  0 |   4 |   669 | 656.88520 |  -12.1148 |
| DDD   |    1 |  0 |  1 |   6 |   645 | 665.50151 |  20.50151 |
| EEE   |    1 |  0 |  1 |   4 |   669 | 655.35650 |  -13.6435 |
| GGG   |    0 |  1 |  1 |   8 |   729 | 729.87613 |   0.87613 |
| HHH   |    0 |  1 |  1 |   8 |   679 | 729.87613 |  50.87613 |
| III   |    0 |  1 |  1 |   8 |   799 | 729.87613 | -69.12387 |
| JJJ   |    0 |  1 |  0 |   4 |   699 | 711.11480 |   12.1148 |
| KKK   |    0 |  0 |  1 |  16 |   699 | 704.25680 |    5.2568 |
#+TBLFM: $7=624.625377644 + 11.9697885194*$2 + 66.1993957702*$3 - 1.52870090624*$4 + 5.07250755283*$5::$8=$7-$6

The fit is not perfect. Maybe the graphical card should be taken into account.
We see that
- the base price is 625€
- a 17" screen costs 12€ more than a 15" one
- i7 costs an additional 66€ over i5
- W OS or F OS has almost no impact
- 1 additional Gb of memory costs 5€

* Table with header

model = ? +?*a +?*b +?*c
---------------(v)
| a | b |  c |  r s |  Best Fit | Fit Diff |
|---+---+----+------+-----------+----------|
| 1 | 5 | 10 | 57.7 |      57.7 |       0. |
| 2 | 2 | 12 | 30.1 |    29.975 |   -0.125 |
| 3 | 9 | 12 | 99.9 |   100.025 |    0.125 |
| 4 | 1 | 17 | 21.3 |    21.425 |    0.125 |
| 5 | 8 | 17 | 91.6 | 91.475000 |   -0.125 |
#+TBLFM: $5=16.7450000002 + 2.99875000004*$1 + 9.57874999999*$2 - 0.993750000022*$3::$6=$5-$4

* Normalize column names and mix them with dollar forms

model = ? +?*$1 +?*bb +?*dari
-------------------------(v)
| a_a | b & b | daŭri |  r s |  Best Fit | Fit Diff |
|-----+-------+-------+------+-----------+----------|
|   1 |     5 |    10 | 57.7 |      57.7 |       0. |
|   2 |     2 |    12 | 30.1 |    29.975 |   -0.125 |
|   3 |     9 |    12 | 99.9 |   100.025 |    0.125 |
|   4 |     1 |    17 | 21.3 |    21.425 |    0.125 |
|   5 |     8 |    17 | 91.6 | 91.475000 |   -0.125 |
#+TBLFM: $5=16.7450000002 + 2.99875000004*$1 + 9.57874999999*$2 - 0.993750000022*$3::$6=$5-$4

* Non linear model
it depends on a*b

model = ? +?*a + ?*b + ?*a*b +?*c
----------------(v)
| a | b |  c | observ |  Best Fit |  Fit Diff |
|---+---+----+--------+-----------+-----------|
| 0 | 1 | 87 |   99.4 | 99.560473 |  0.160473 |
| 1 | 9 |  8 |  101.8 | 101.76330 |   -0.0367 |
| 2 | 2 | 28 |   67.5 | 65.056257 | -2.443743 |
| 3 | 2 | 87 |  130.6 | 131.65724 |   1.05724 |
| 4 | 2 | 10 |   60.2 | 62.309656 |  2.109656 |
| 5 | 6 | 64 |  159.5 | 160.06182 |   0.56182 |
| 6 | 7 | 61 |  173.9 | 173.53402 |  -0.36598 |
| 7 | 2 | 69 |  145.2 | 144.15723 |  -1.04277 |
#+TBLFM: $5=3.36649305617 + 7.69911932103*$1 + 9.22687980815*$2 - 0.0379115297398*$1*$2 + 0.999621843889*$3::$6=$5-$4

* Table with active header

model = ? +?*a1 +?*b2 +?*c3
-------------------------(v)
| ! | a 1 | b 2 | c 3 | observ |  Best Fit |  Fit Diff |
|---+-----+-----+-----+--------+-----------+-----------|
| # |   0 |   1 |  87 | 105.34 | 105.36715 |   0.02715 |
| # |   1 |   9 |   8 | 105.58 | 105.54965 |  -0.03035 |
| # |   2 |   2 |  28 |  69.75 | 69.519725 | -0.230275 |
| # |   3 |   2 |  87 | 135.46 | 135.54788 |   0.08788 |
| # |   4 |   2 |  10 |  65.42 | 65.641566 |  0.221566 |
| # |   5 |   6 |  64 | 162.65 | 162.71606 |   0.06606 |
| # |   6 |   7 |  61 | 175.79 | 175.78507 |  -4.93e-3 |
| # |   7 |   2 |  69 | 145.92 | 145.78289 |  -0.13711 |
#+TBLFM: $6=9.39808332395 + 7.05658413023*$2 + 9.01098182151*$3 + 0.999518215689*$4::$7=$6-$5

model = ? +?*b2 +?*c3 +?*observ
------(v)
| ! | a 1 | b 2 | c 3 | observ |     Best Fit |     Fit Diff |
|---+-----+-----+-----+--------+--------------+--------------|
| # |   0 |   1 |  87 | 105.34 | -3.597926e-3 | -3.597926e-3 |
| # |   1 |   9 |   8 | 105.58 |    1.0044684 |    4.4684e-3 |
| # |   2 |   2 |  28 |  69.75 |    2.0326884 |    0.0326884 |
| # |   3 |   2 |  87 | 135.46 |    2.9876022 |   -0.0123978 |
| # |   4 |   2 |  10 |  65.42 |    3.9685065 |   -0.0314935 |
| # |   5 |   6 |  64 | 162.65 |    4.9905707 |   -9.4293e-3 |
| # |   6 |   7 |  61 | 175.79 |    6.0005682 |     5.682e-4 |
| # |   7 |   2 |  69 | 145.92 |    7.0191936 |    0.0191936 |
#+TBLFM: $6=-1.33158370644 - 1.27686535833*$3 - 0.141632666813*$4 + 0.141702042448*$5::$7=$6-$2

* More variables than observations
The fit is perfect

model = ? +?*a +?*b +?*c +?*a*b +?*a*c +?*b*c +?*a*a +?*b*b +?*c*c
--------------------(v)
| ! | a | b |  c | observ |  Best Fit | Fit Diff |
|---+---+---+----+--------+-----------+----------|
| # | 0 | 1 | 87 |   99.4 | 99.400000 |       0. |
| # | 1 | 9 |  8 |  101.8 |     101.8 |       0. |
| # | 2 | 2 | 28 |   67.5 | 67.500000 |       0. |
| # | 3 | 2 | 87 |  130.6 |     130.6 |       0. |
| # | 4 | 2 | 10 |   60.2 | 60.200000 |       0. |
| # | 5 | 6 | 64 |  159.5 | 159.50000 |       0. |
| # | 6 | 7 | 61 |  173.9 |     173.9 |       0. |
| # | 7 | 2 | 69 |  145.2 | 145.20000 |       0. |
#+TBLFM: $6=10.4900031258 + 16.991176528*$2 - 13.5614563837*$3 + 1.80261763659*$4 - 1.13804949187*$2*$3 - 0.0453259054771*$2*$4 + 0.122043148842*$3*$4 - 0.557716049364*$2^2 + 2.28265852508*$3^2 - 8.88580969744e-3*$4^2::$7=$6-$5

* Bigger table

model = ? +?*a +?*b +?*c +?*a*a +?*b*b +?*c*c +?*a*b +?*a*c +?*b*c
--------------------(v)
| ! |  a | b |  c |    obs |   Best Fit |  Fit Diff |
|---+----+---+----+--------+------------+-----------|
| # |  6 | 1 | 16 |  30.25 |  30.190616 | -0.059384 |
| # | 14 | 5 | 13 |  42.25 |  42.304006 |  0.054006 |
| # | 14 | 4 |  9 |  56.25 |  56.069637 | -0.180363 |
| # |  9 | 5 | 10 |  61.50 |  61.506849 |  6.849e-3 |
| # |  0 | 1 | 15 |  66.75 |  66.757201 |  7.201e-3 |
| # |  5 | 3 | 13 |  50.25 |  50.497710 |   0.24771 |
| # |  2 | 5 | 16 |  63.25 |  63.251220 |   1.22e-3 |
| # |  9 | 3 |  7 |  58.50 |  58.512584 |  0.012584 |
| # |  8 | 2 | 12 |  37.25 |  36.989353 | -0.260647 |
| # |  7 | 5 |  9 |  64.25 |  64.511016 |  0.261016 |
| # |  8 | 4 |  0 |  86.00 |  85.991722 | -8.278e-3 |
| # |  6 | 0 |  2 |  52.00 |  51.940854 | -0.059146 |
| # | 10 | 2 |  7 |  50.00 |  50.007317 |  7.317e-3 |
| # |  0 | 4 | 19 |  73.00 |  72.992085 | -7.915e-3 |
| # |  5 | 3 | 12 |  52.00 |  52.004917 |  4.917e-3 |
| # |  6 | 4 |  0 |  78.00 |  78.007330 |   7.33e-3 |
| # |  6 | 5 | 19 |  44.50 |  44.175531 | -0.324469 |
| # | 14 | 5 |  9 |  66.25 |  66.310583 |  0.060583 |
| # |  6 | 7 | 19 |  51.00 |  51.140575 |  0.140575 |
| # | 14 | 1 | 19 | -37.75 | -37.727872 |  0.022128 |
| # |  8 | 1 | 17 |  14.25 |  14.688457 |  0.438457 |
| # |  6 | 1 | 10 |  42.50 |  42.228643 | -0.271357 |
| # |  6 | 7 |  2 |  85.40 |  85.247417 | -0.152583 |
| # | 14 | 6 |  5 | 100.00 |  100.03579 |   0.03579 |
| # |  2 | 0 |  7 |  52.00 |  51.995448 | -4.552e-3 |
| # | 11 | 6 | 10 |  68.50 |  68.504730 |   4.73e-3 |
| # | 13 | 3 | 16 |   8.00 |  8.0329690 |  0.032969 |
| # | 10 | 7 |  2 | 106.25 |  106.22272 |  -0.02728 |
| # | 10 | 4 | 15 |  34.00 |  33.992732 | -7.268e-3 |
| # |  4 | 0 |  1 |  53.00 |  52.954916 | -0.045084 |
| # | 13 | 0 | 12 |  -3.00 | -2.9866958 | 0.0133042 |
| # |  0 | 2 |  7 |  60.00 |  60.092797 |  0.092797 |
| # |  8 | 4 |  7 |  65.00 |  65.015341 |  0.015341 |
| # |  3 | 2 | 17 |  52.00 |  51.961119 | -0.038881 |
| # | 10 | 1 |  1 |  65.00 |  65.208878 |  0.208878 |
| # | 14 | 2 | 11 |  22.25 |  22.067117 | -0.182883 |
| # |  9 | 5 | 18 |  33.50 |  33.447102 | -0.052898 |
| # |  7 | 5 | 13 |  54.50 |  54.489353 | -0.010647 |
| # | 11 | 3 | 13 |  31.00 |  31.016700 |    0.0167 |
| # |  1 | 4 | 16 |  66.00 |  66.019310 |   0.01931 |
| # |  5 | 2 | 17 |  40.00 |  39.948577 | -0.051423 |
| # |  8 | 4 |  9 |  59.00 |  59.012699 |  0.012699 |
| # |  6 | 3 |  7 |  59.25 |  59.267455 |  0.017455 |
| # | 14 | 6 |  7 |  88.00 |  88.042081 |  0.042081 |
| # |  3 | 2 | 17 |  52.00 |  51.961119 | -0.038881 |
#+TBLFM: $6=50.0286486413 + 0.97383137796*$2 + 2.03969765393*$3 + 1.0044190737*$4 + 1.55554750813e-3*$2^2 - 0.253663691799*$3^2 - 5.21686927352e-4*$4^2 + 0.749146746167*$2*$3 - 0.499461191284*$2*$4 - 4.25906301855e-4*$3*$4::$7=$6-$5

* Apples & bananas

We need to estimate the average weight of apples, bananas, and
strawberries.  But we only have weights for some packages containing a
mix of such fruits.

The weight of a package is the weight of apples, bananas, and
strawberries composing the package, plus the packaging itself.  The
packagings are all the same.

Let us store data in an Org Mode table, one row per observation.  Each
row counts the number of fruits in a pack, plus the weight of the pack
(in grams).

model = ? +?*apples +?*bananas +?*strawberries
---------------------------------------(v)
| apples | bananas | strawberries | total weight |  Best Fit | Fit Diff |
|--------+---------+--------------+--------------+-----------+----------|
|      8 |       4 |           48 |         2928 | 2926.3703 |  -1.6297 |
|     11 |       8 |           21 |         3561 | 3561.9015 |   0.9015 |
|      9 |       6 |           32 |         3140 | 3146.7249 |   6.7249 |
|      8 |       3 |           47 |         2737 | 2741.0002 |   4.0002 |
|     10 |       1 |           27 |         2349 | 2339.6510 |   -9.349 |
|     10 |       0 |           11 |         1927 | 1929.1452 |   2.1452 |
|      7 |       6 |           10 |         2581 | 2576.9723 |  -4.0277 |
|      5 |       1 |           11 |         1499 | 1500.6219 |   1.6219 |
|      1 |       8 |           13 |         2245 | 2244.0603 |  -0.9397 |
|      9 |       5 |           42 |         3128 | 3126.4541 |  -1.5459 |
|      7 |       6 |           26 |         2818 | 2817.1169 |  -0.8831 |
|      1 |       2 |           40 |         1630 | 1627.1375 |  -2.8625 |
|      9 |       6 |           33 |         3160 | 3161.7339 |   1.7339 |
|      5 |       8 |           32 |         3009 | 3008.3396 |  -0.6604 |
|      3 |       0 |           18 |         1191 | 1195.7703 |   4.7703 |
#+TBLFM: $5=566.276919769 + 119.776891962*$1 + 170.361128214*$2 + 15.0090368021*$3::$6=$5-$4

The fit is quite good. It should be interpreted as:
- weight of the packaging  = 566.276919769 grams
- weight of one apple      = 119.776891962 grams
- weight of one banana     = 170.361128214 grams
- weight of one strawberry =  15.009036802 grams

* Example: revenue of a shop

A shop gets changing revenues.  Less sells are performed when weather
is rainy.  More sells are performed on Saturdays.  To be sure,
observations are recorded over a few days.  Here they are, one row per
day:

model = ? +?*Saturday +?*Rainy +?*Sunny +?*Winter
----------------------------------------(v)
| Saturday | Rainy | Sunny | Winter | Revenue |  Best Fit | Fit Diff |
|----------+-------+-------+--------+---------+-----------+----------|
|        1 |     1 |     0 |      0 |   19674 | 19822.201 |  148.201 |
|        0 |     1 |     0 |      0 |   13972 | 13913.896 |  -58.104 |
|        0 |     1 |     0 |      0 |   13845 | 13913.896 |   68.896 |
|        0 |     0 |     0 |      0 |   15997 | 15996.723 |   -0.277 |
|        0 |     0 |     1 |      0 |   15253 | 15254.148 |    1.148 |
|        0 |     0 |     1 |      0 |   15466 | 15254.148 | -211.852 |
|        1 |     0 |     0 |      0 |   22128 | 21905.028 | -222.972 |
|        0 |     0 |     0 |      0 |   16092 | 15996.723 |  -95.277 |
|        0 |     0 |     0 |      0 |   15764 | 15996.723 |  232.723 |
|        0 |     1 |     0 |      0 |   14116 | 13913.896 | -202.104 |
|        0 |     1 |     0 |      0 |   13817 | 13913.896 |   96.896 |
|        0 |     0 |     0 |      0 |   15754 | 15996.723 |  242.723 |
|        1 |     0 |     1 |      1 |   20593 | 20667.771 |   74.771 |
|        0 |     0 |     1 |      1 |   14592 | 14759.466 |  167.466 |
|        0 |     0 |     1 |      1 |   14791 | 14759.466 |  -31.534 |
|        0 |     0 |     0 |      1 |   15653 | 15502.041 | -150.959 |
|        0 |     1 |     0 |      1 |   13473 | 13419.214 |  -53.786 |
|        0 |     0 |     0 |      1 |   15508 | 15502.041 |   -5.959 |
#+TBLFM: $6=15996.7226519 + 5908.30497238*$1 - 2082.82651934*$2 - 742.574585636*$3 - 494.681767955*$4::$7=$6-$5

Note that a day may be neither rainy nor sunny.  Observations are not
very precise: for instance, a day may be rainy only in the morning,
but it is recorded as "1".  Winter season is also quite coarse, as it
is either 1 or 0, nothing in between.

Not bad: revenue is predicted within 1% error.

The formula is interesting.  Let us look at it in detail:

$6=
  15996.7226519
  + 5908.30497238 $1
  - 2082.82651934 $2
  - 742.574585636 $3
  - 494.681767955 $4

We get what we were looking for: the influence of each factor on the
revenue.  We have:
- a base revenue of 15997
- an additional 5908 revenue on Saturdays
- a big negative impact of rain: 2083 lost in revenue
- sunny days lessen revenue by 743 too
- in winter 495 is lost every day.

The surprise comes from the bad impact of rain *and* sun.  Actually,
people are more eager to shop on cloudy days.

Even though the fit is not perfect, it gives figures which can help
steering the activity.  More sales persons are required on Saturday,
and less on rainy days, and we know approximately how many:
- 5908 / 15997 = 37% more on Saturdays
- 2083 / 15997 = 13% less on rainy days
- etc.

This kind of analysis can be further enhanced.  More observations will
smooth statistical errors.  More criterias will better explain the
revenue.  For instance, adding a column about movies blockbusters may
give better fit with less differences (people go to movies theaters
instead of shopping).

* Big table

model = ? +?*a +?*b +?*c +?*d +?*e
----------------------------(v)
|  a |   b | c |  d |  e |       r |  Best Fit | Fit Diff |
|----+-----+---+----+----+---------+-----------+----------|
| 81 | 190 | 7 | 26 | 56 |  801.74 | 801.59833 | -0.14167 |
| 35 | 176 | 4 | 33 | 79 |  663.89 | 663.51505 | -0.37495 |
| 36 | 155 | 3 | 35 | 96 |  630.88 | 630.49817 | -0.38183 |
| 61 | 122 | 5 | 39 | 76 |  535.66 | 535.53769 | -0.12231 |
| 98 | 116 | 0 | 29 | 98 |  622.40 | 622.56128 |  0.16128 |
| 18 | 112 | 6 | 40 | 88 |  466.55 | 466.47377 | -0.07623 |
| 53 | 111 | 8 | 45 | 54 |  441.94 | 441.54349 | -0.39651 |
| 65 | 142 | 5 | 29 | 84 |  667.40 | 667.54353 |  0.14353 |
| 91 | 138 | 1 |  4 | 84 |  747.65 | 747.56965 | -0.08035 |
| 30 | 164 | 7 | 25 | 55 |  622.18 | 622.52622 |  0.34622 |
| 36 | 140 | 3 | 12 | 60 |  569.47 | 569.51761 |  0.04761 |
| 29 | 177 | 1 | 22 | 98 |  710.81 | 710.49057 | -0.31943 |
| 80 | 139 | 4 | 20 | 74 |  679.90 | 679.56688 | -0.33312 |
|  2 | 116 | 8 | 26 | 97 |  559.10 | 559.45269 |  0.35269 |
| 93 | 113 | 6 |  1 | 76 |  739.69 | 739.57981 | -0.11019 |
| 82 | 181 | 3 | 40 | 96 |  780.96 | 780.56430 |  -0.3957 |
| 24 | 134 | 9 | 31 | 52 |  517.97 | 517.51579 | -0.45421 |
| 58 | 198 | 1 | 14 | 51 |  722.89 | 722.56341 | -0.32659 |
| 58 | 137 | 6 | 29 | 53 |  560.23 | 560.55445 |  0.32445 |
| 87 | 140 | 7 | 37 | 93 |  730.81 | 730.56910 |  -0.2409 |
| 84 | 189 | 2 | 19 | 66 |  787.10 | 787.58679 |  0.48679 |
| 70 | 157 | 0 | 16 | 70 |  657.89 | 657.55413 | -0.33587 |
|  1 | 132 | 3 |  5 | 97 |  614.22 | 614.44732 |  0.22732 |
| 23 | 153 | 7 |  3 | 80 |  738.34 | 738.49936 |  0.15936 |
|  1 | 178 | 0 | 49 | 71 |  453.55 | 453.46884 | -0.08116 |
| 14 | 109 | 1 | 26 | 93 |  445.47 | 445.45606 | -0.01394 |
| 73 | 108 | 3 | 45 | 99 |  532.04 | 532.53114 |  0.49114 |
| 78 | 141 | 9 | 21 | 85 |  785.42 | 785.56701 |  0.14701 |
| 82 | 158 | 4 |  0 | 98 |  892.32 | 892.56019 |  0.24019 |
| 14 | 169 | 8 | 21 | 58 |  645.62 | 645.50699 | -0.11301 |
| 91 | 144 | 7 | 31 | 63 |  684.19 | 684.59439 |  0.40439 |
| 44 | 126 | 2 | 33 | 64 |  456.51 | 456.51909 |  9.09e-3 |
| 83 | 154 | 1 | 42 | 73 |  594.24 | 594.56910 |   0.3291 |
| 51 | 198 | 5 | 18 | 67 |  800.84 | 800.55148 | -0.28852 |
| 59 | 137 | 6 | 21 | 96 |  723.37 | 723.52904 |  0.15904 |
| 28 | 154 | 2 | 33 | 89 |  583.31 | 583.49022 |  0.18022 |
| 31 | 160 | 4 | 19 | 74 |  648.68 | 648.50927 | -0.17073 |
| 88 | 194 | 3 | 21 | 54 |  781.84 | 781.60257 | -0.23743 |
| 55 | 133 | 5 | 30 | 54 |  526.93 | 526.54702 | -0.38298 |
| 91 | 156 | 0 | 21 | 87 |  727.37 | 727.57012 |  0.20012 |
| 78 | 173 | 4 | 44 | 93 |  738.84 | 738.56056 | -0.27944 |
| 25 | 134 | 1 | 17 | 59 |  476.54 | 476.49860 |  -0.0414 |
| 12 | 144 | 6 | 28 | 74 |  556.71 | 556.48379 | -0.22621 |
| 86 | 145 | 7 | 11 | 93 |  847.70 | 847.57010 |  -0.1299 |
| 47 | 178 | 9 | 48 | 88 |  735.27 | 735.53399 |  0.26399 |
| 67 | 175 | 5 | 33 | 51 |  655.96 | 655.57549 | -0.38451 |
| 59 | 166 | 2 | 13 | 99 |  791.40 | 791.52789 |  0.12789 |
| 79 | 184 | 9 | 44 | 99 |  866.72 | 866.57014 | -0.14986 |
| 26 | 197 | 0 | 31 | 62 |  605.13 | 605.51248 |  0.38248 |
| 34 | 178 | 7 | 29 | 54 |  653.41 | 653.53560 |   0.1256 |
| 45 | 189 | 7 | 18 | 95 |  875.28 | 875.52740 |   0.2474 |
| 79 | 108 | 0 | 44 | 91 |  479.83 | 479.53847 | -0.29153 |
| 24 | 105 | 4 | 42 | 74 |  377.02 | 377.48472 |  0.46472 |
| 98 | 195 | 2 | 23 | 64 |  811.20 | 811.60757 |  0.40757 |
|  7 | 107 | 5 |  6 | 61 |  469.02 | 469.47461 |  0.45461 |
| 57 | 107 | 1 | 37 | 98 |  496.73 | 496.50749 | -0.22251 |
| 63 | 157 | 1 | 11 | 63 |  657.35 | 657.55150 |   0.2015 |
| 99 | 104 | 0 |  9 | 89 |  641.89 | 641.56575 | -0.32425 |
| 87 | 121 | 5 | 27 | 91 |  677.15 | 677.56201 |  0.41201 |
| 37 | 133 | 6 | 14 | 87 |  668.84 | 668.50548 | -0.33452 |
| 39 | 100 | 1 | 28 | 60 |  361.05 | 361.50657 |  0.45657 |
| 35 | 138 | 0 | 34 | 66 |  446.21 | 446.50574 |  0.29574 |
| 86 | 143 | 1 | 25 | 98 |  710.12 | 710.55497 |  0.43497 |
|  2 | 187 | 4 | 30 | 54 |  567.46 | 567.49119 |  0.03119 |
|  4 | 171 | 4 | 33 | 84 |  601.88 | 601.47056 | -0.40944 |
| 74 | 157 | 7 | 15 | 72 |  780.18 | 780.57085 |  0.39085 |
| 12 | 130 | 4 |  5 | 84 |  606.53 | 606.47097 | -0.05903 |
| 77 | 101 | 2 |  0 | 57 |  558.91 | 558.56062 | -0.34938 |
| 20 | 172 | 2 |  1 | 64 |  674.80 | 674.50156 | -0.29844 |
| 15 | 157 | 1 | 28 | 58 |  478.68 | 478.49206 | -0.18794 |
| 93 | 100 | 7 |  8 | 62 |  645.89 | 645.58670 |  -0.3033 |
| 89 | 158 | 4 | 20 | 59 |  709.54 | 709.59298 |  0.05298 |
| 86 | 168 | 5 | 32 | 93 |  802.30 | 802.57182 |  0.27182 |
| 83 | 107 | 2 |  8 | 95 |  670.15 | 670.54582 |  0.39582 |
| 23 | 151 | 3 | 19 | 77 |  599.82 | 599.49283 | -0.32717 |
| 39 | 167 | 5 |  6 | 84 |  782.22 | 782.51748 |  0.29748 |
| 36 | 157 | 0 | 24 | 93 |  626.17 | 626.49551 |  0.32551 |
|  4 | 126 | 3 | 43 | 79 |  396.38 | 396.45950 |   0.0795 |
|  2 | 104 | 5 |  3 | 75 |  504.82 | 504.45867 | -0.36133 |
| 41 | 190 | 9 | 36 | 51 |  696.39 | 696.55312 |  0.16312 |
| 85 | 137 | 3 | 41 | 88 |  626.72 | 626.56142 | -0.15858 |
| 19 | 133 | 7 | 39 | 87 |  547.62 | 547.48315 | -0.13685 |
| 66 | 112 | 1 |  4 | 96 |  655.23 | 655.52290 |   0.2929 |
| 16 | 138 | 9 |  2 | 76 |  701.97 | 701.49252 | -0.47748 |
| 57 | 130 | 2 | 24 | 50 |  488.31 | 488.54606 |  0.23606 |
| 67 | 165 | 0 | 21 | 97 |  736.80 | 736.53526 | -0.26474 |
| 86 | 183 | 5 | 13 | 72 |  860.06 | 860.58970 |   0.5297 |
| 40 | 160 | 1 | 41 | 76 |  539.23 | 539.51335 |  0.28335 |
| 91 | 189 | 9 | 39 | 89 |  895.86 | 895.59342 | -0.26658 |
| 43 | 175 | 5 | 49 | 50 |  540.38 | 540.54455 |  0.16455 |
| 82 | 149 | 5 | 28 | 87 |  735.79 | 735.56550 |  -0.2245 |
| 98 | 115 | 5 | 47 | 81 |  571.40 | 571.58015 |  0.18015 |
| 32 | 170 | 9 | 31 | 50 |  635.15 | 635.53697 |  0.38697 |
| 13 | 187 | 5 | 42 | 79 |  631.31 | 631.49108 |  0.18108 |
| 10 | 167 | 0 |  9 | 76 |  613.06 | 613.47584 |  0.41584 |
| 82 | 169 | 9 | 43 | 67 |  735.47 | 735.59014 |  0.12014 |
| 81 | 103 | 7 | 46 | 86 |  550.96 | 550.55555 | -0.40445 |
| 28 | 105 | 5 | 36 | 87 |  463.33 | 463.48376 |  0.15376 |
| 29 | 156 | 9 | 27 | 96 |  741.47 | 741.50063 |  0.03063 |
| 77 | 192 | 5 | 20 | 70 |  835.89 | 835.58148 | -0.30852 |
| 46 | 102 | 1 | 49 | 66 |  315.69 | 315.51161 | -0.17839 |
|  0 | 141 | 0 | 41 | 62 |  345.78 | 345.46362 | -0.31638 |
| 57 | 174 | 5 |  8 | 90 |  849.60 | 849.53875 | -0.06125 |
| 38 | 158 | 7 | 34 | 87 |  680.41 | 680.51453 |  0.10453 |
| 66 | 104 | 6 |  8 | 89 |  669.88 | 669.53414 | -0.34586 |
| 71 | 145 | 6 | 13 | 92 |  791.81 | 791.54946 | -0.26054 |
| 12 | 100 | 0 | 38 | 65 |  267.83 | 267.46639 | -0.36361 |
| 32 | 139 | 8 | 44 | 98 |  619.54 | 619.49627 | -0.04373 |
| 15 | 145 | 5 | 13 | 77 |  619.95 | 619.48477 | -0.46523 |
| 13 | 195 | 9 | 35 | 58 |  680.60 | 680.51395 | -0.08605 |
| 62 | 134 | 4 |  3 | 57 |  645.01 | 645.55360 |   0.5436 |
| 19 | 127 | 4 | 25 | 81 |  522.98 | 522.48036 | -0.49964 |
| 79 | 105 | 4 | 42 | 67 |  466.96 | 466.56010 |  -0.3999 |
| 27 | 112 | 5 | 19 | 58 |  463.01 | 463.50317 |  0.49317 |
| 60 | 176 | 8 | 24 | 72 |  788.05 | 788.55934 |  0.50934 |
| 28 | 119 | 2 | 13 | 70 |  501.28 | 501.49354 |  0.21354 |
| 84 | 168 | 5 | 18 | 96 |  863.40 | 863.56786 |  0.16786 |
| 22 | 161 | 8 | 28 | 97 |  726.53 | 726.49044 | -0.03956 |
| 95 | 162 | 8 | 29 | 67 |  781.50 | 781.60374 |  0.10374 |
| 38 | 154 | 1 | 25 | 87 |  614.13 | 614.50285 |  0.37285 |
|  8 | 134 | 3 | 46 | 98 |  473.62 | 473.45476 | -0.16524 |
| 41 | 141 | 3 | 28 | 66 |  536.71 | 536.51997 | -0.19003 |
| 25 | 130 | 9 | 44 | 87 |  560.89 | 560.49356 | -0.39644 |
| 15 | 193 | 6 | 24 | 64 |  695.58 | 695.50716 | -0.07284 |
| 68 | 184 | 2 | 39 | 73 |  681.77 | 681.55968 | -0.21032 |
| 25 | 158 | 3 |  1 | 83 |  714.29 | 714.49417 |  0.20417 |
| 82 | 116 | 3 | 26 | 93 |  632.81 | 632.54935 | -0.26065 |
| 70 | 132 | 1 | 24 | 88 |  619.85 | 619.53769 | -0.31231 |
| 27 | 173 | 9 |  7 | 59 |  757.11 | 757.52655 |  0.41655 |
| 40 | 198 | 4 | 23 | 56 |  710.91 | 710.54218 | -0.36782 |
|  6 | 128 | 6 | 28 | 51 |  427.63 | 427.48622 | -0.14378 |
| 54 | 137 | 3 |  4 | 77 |  679.98 | 679.52966 | -0.45034 |
| 39 | 107 | 5 |  1 | 53 |  529.65 | 529.52112 | -0.12888 |
| 54 | 134 | 0 | 26 | 91 |  579.71 | 579.51379 | -0.19621 |
| 46 | 149 | 8 |  7 | 95 |  816.26 | 816.52025 |  0.26025 |
| 97 | 189 | 8 |  2 | 76 | 1001.99 | 1001.6089 |  -0.3811 |
| 76 | 193 | 0 | 36 | 95 |  772.67 | 772.55506 | -0.11494 |
| 31 | 132 | 5 | 14 | 69 |  584.67 | 584.50694 | -0.16306 |
| 83 | 176 | 1 | 49 | 55 |  578.82 | 578.58602 | -0.23398 |
| 90 | 147 | 9 | 33 | 90 |  794.81 | 794.58052 | -0.22948 |
| 44 | 109 | 6 | 13 | 97 |  644.09 | 644.50187 |  0.41187 |
| 25 | 150 | 1 | 38 | 58 |  437.74 | 437.50273 | -0.23727 |
| 37 | 170 | 8 |  9 | 86 |  826.80 | 826.51981 | -0.28019 |
| 88 | 166 | 4 | 34 | 99 |  795.72 | 795.56820 |  -0.1518 |
| 50 | 175 | 6 | 14 | 83 |  808.52 | 808.53598 |  0.01598 |
| 36 | 143 | 5 | 32 | 71 |  561.17 | 561.51442 |  0.34442 |
| 89 | 141 | 0 | 26 | 59 |  574.34 | 574.58093 |  0.24093 |
| 71 | 136 | 7 | 42 | 57 |  558.65 | 558.56980 |  -0.0802 |
| 92 | 167 | 0 | 28 | 55 |  638.60 | 638.59418 | -5.82e-3 |
| 42 | 142 | 1 | 15 | 54 |  527.35 | 527.52589 |  0.17589 |
| 97 | 146 | 3 | 27 | 70 |  679.77 | 679.59112 | -0.17888 |
| 14 | 187 | 7 |  9 | 69 |  765.45 | 765.50350 |   0.0535 |
|  8 | 181 | 0 | 35 | 57 |  490.33 | 490.48797 |  0.15797 |
| 24 | 175 | 0 | 32 | 56 |  513.23 | 513.50776 |  0.27776 |
| 31 | 197 | 5 | 30 | 77 |  739.49 | 739.51868 |  0.02868 |
|  4 | 159 | 7 | 40 | 83 |  579.35 | 579.47320 |   0.1232 |
| 75 | 139 | 1 | 44 | 95 |  591.59 | 591.54089 | -0.04911 |
| 91 | 172 | 8 | 36 | 54 |  736.82 | 736.60915 | -0.21085 |
| 28 | 146 | 3 | 31 | 55 |  480.70 | 480.51132 | -0.18868 |
| 54 | 196 | 2 | 34 | 98 |  784.02 | 784.52930 |   0.5093 |
| 77 | 106 | 6 |  0 | 53 |  621.58 | 621.57176 | -8.24e-3 |
| 19 | 130 | 7 |  8 | 90 |  671.25 | 671.48160 |   0.2316 |
| 50 | 162 | 7 | 48 | 79 |  636.59 | 636.53560 |  -0.0544 |
| 39 | 108 | 1 | 10 | 85 |  532.65 | 532.49367 | -0.15633 |
| 14 | 158 | 1 | 45 | 63 |  426.60 | 426.48727 | -0.11273 |
| 38 | 105 | 6 | 13 | 98 |  623.14 | 623.49243 |  0.35243 |
| 22 | 119 | 1 |  7 | 58 |  462.70 | 462.49172 | -0.20828 |
| 50 | 144 | 3 | 11 | 97 |  724.68 | 724.51355 | -0.16645 |
|  3 | 121 | 4 | 40 | 73 |  388.13 | 388.46258 |  0.33258 |
| 82 | 102 | 9 | 24 | 92 |  685.51 | 685.55726 |  0.04726 |
| 88 | 106 | 7 | 30 | 89 |  646.85 | 646.56409 | -0.28591 |
| 92 | 171 | 9 | 21 | 63 |  837.36 | 837.60689 |  0.24689 |
| 19 | 187 | 6 | 37 | 60 |  621.43 | 621.51276 |  0.08276 |
| 31 | 135 | 3 | 38 | 95 |  545.12 | 545.48689 |  0.36689 |
| 99 | 107 | 6 | 23 | 80 |  657.19 | 657.58264 |  0.39264 |
| 56 | 189 | 7 | 36 | 51 |  693.20 | 693.56856 |  0.36856 |
| 21 | 168 | 5 | 33 | 97 |  680.92 | 680.48537 | -0.43463 |
| 13 | 115 | 2 | 25 | 70 |  411.32 | 411.47267 |  0.15267 |
| 75 | 160 | 9 | 12 | 66 |  815.91 | 815.58046 | -0.32954 |
| 63 | 138 | 7 | 26 | 51 |  594.67 | 594.56436 | -0.10564 |
| 43 | 136 | 8 |  8 | 87 |  743.46 | 743.51789 |  0.05789 |
| 77 | 151 | 4 |  7 | 69 |  746.74 | 746.56982 | -0.17018 |
| 88 | 186 | 7 | 11 | 84 |  947.75 | 947.58927 | -0.16073 |
|  0 | 114 | 8 | 48 | 90 |  440.28 | 440.45317 |  0.17317 |
| 91 | 161 | 4 | 18 | 64 |  745.91 | 745.59330 |  -0.3167 |
| 61 | 116 | 4 |  6 | 78 |  640.93 | 640.53422 | -0.39578 |
| 46 | 101 | 9 |  5 | 67 |  611.53 | 611.52691 | -3.09e-3 |
| 93 | 178 | 1 | 46 | 83 |  700.21 | 700.58199 |  0.37199 |
| 40 | 133 | 7 | 32 | 77 |  587.89 | 587.51679 | -0.37321 |
| 79 | 111 | 0 | 43 | 88 |  483.05 | 483.54119 |  0.49119 |
| 16 | 167 | 1 | 27 | 94 |  622.96 | 622.47345 | -0.48655 |
| 98 | 198 | 6 | 37 | 72 |  848.59 | 848.61014 |  0.02014 |
| 84 | 181 | 9 | 15 | 72 |  902.42 | 902.59381 |  0.17381 |
| 60 | 170 | 3 | 45 | 67 |  596.53 | 596.55099 |  0.02099 |
| 35 | 115 | 9 |  5 | 63 |  619.36 | 619.51896 |  0.15896 |
| 55 | 132 | 9 | 33 | 69 |  616.03 | 616.54452 |  0.51452 |
| 32 | 101 | 4 |  3 | 59 |  492.30 | 492.50482 |  0.20482 |
| 95 | 136 | 5 |  2 | 76 |  793.31 | 793.58667 |  0.27667 |
|  4 | 111 | 8 | 48 | 69 |  376.32 | 376.47072 |  0.15072 |
| 18 | 160 | 7 |  7 | 52 |  649.27 | 649.51221 |  0.24221 |
| 47 | 174 | 4 |  8 | 75 |  769.88 | 769.53343 | -0.34657 |
| 74 | 103 | 7 | 49 | 80 |  506.74 | 506.55017 | -0.18983 |
| 53 | 162 | 1 | 23 | 54 |  577.99 | 577.54514 | -0.44486 |
| 33 | 124 | 6 | 44 | 82 |  498.38 | 498.49995 |  0.11995 |
| 33 | 137 | 1 | 46 | 53 |  367.28 | 367.51244 |  0.23244 |
| 83 | 161 | 2 | 43 | 92 |  683.29 | 683.56083 |  0.27083 |
| 56 | 142 | 3 | 33 | 53 |  510.48 | 510.54758 |  0.06758 |
|  9 | 125 | 4 | 38 | 59 |  378.49 | 378.48025 | -9.75e-3 |
#+TBLFM: $7=2.00129080599*$1 - 99.5335835577 + 3.0002668215*$2 + 15.0018239589*$3 - 4.00003659322*$4 + 2.99937221779*$5::$8=$7-$6

The resulting formula contains numerical values quite close from integer.  Probably the model should be rounded:
: 2*$1 - 99.5 + 3*$2 + 15*$3 - 4*$4 + 3*$5

* Example population employee rate

City vs. country side employment rate in the population is given in the following table. Female employees are marked with 1 in the 'F' column.

Can this rate be predicted?

model = ? +?*urban +?*F
----------------(v)
| urban | F |  rate |   Best Fit |    Fit Diff |
|-------+---+-------+------------+-------------|
|     1 | 1 | 0.390 | 0.35885714 | -0.03114286 |
|     1 | 0 | 0.438 | 0.45128571 |  0.01328571 |
|     1 | 1 | 0.341 | 0.35885714 |  0.01785714 |
|     0 | 0 | 0.457 | 0.44371429 | -0.01328571 |
|     0 | 1 | 0.338 | 0.35128571 |  0.01328571 |
#+TBLFM: $4=0.443714285714 + 7.57142857143e-3*$1 - 0.0924285714286*$2::$5=$4-$3

We see that:
- average employment rate is 0.444
- urban employment is slightly higher: 0.00757
- female employment is lower than average by 0.092

* Holes
This problem can be solved
- by pre-school children in five minutes
- by data scientists in an hour
- and by people with higher education…

How long will you need to solve it ?

8809 = 6
7111 = 0
2172 = 0
6666 = 4
1111 = 0
3213 = 0
7662 = 2
9313 = 1
0000 = 4
2222 = 0
3333 = 0
5555 = 0
8193 = 3
8096 = 5
1012 = 1
7777 = 0
9999 = 4
7756 = 1
6855 = 3
9881 = 5
5531 = 0
2581 = ???

Let us put it in the form of an Org table.
For exmaple, column 'a3' tells how many '3' digits aare there in the observation.
Note that there is no 'a4' column.
We want to predict column 'n'.

model = ?*a0 +?*a1 +?*a2 +?*a3 +?*a5 +?*a6 +?*a7 +?*a8 +?*a9
----------------------------------------------(v)
| a0 | a1 | a2 | a3 | a5 | a6 | a7 | a8 | a9 | n |       Best Fit |       Fit Diff |
|----+----+----+----+----+----+----+----+----+---+----------------+----------------|
|  1 |  0 |  0 |  0 |  0 |  0 |  0 |  2 |  1 | 6 |             6. |             0. |
|  0 |  3 |  0 |  0 |  0 |  0 |  1 |  0 |  0 | 0 |  7.7481020e-15 |   7.748102e-15 |
|  0 |  1 |  2 |  0 |  0 |  0 |  1 |  0 |  0 | 0 | -1.2058108e-14 | -1.2058108e-14 |
|  0 |  0 |  0 |  0 |  0 |  4 |  0 |  0 |  0 | 4 |             4. |             0. |
|  0 |  4 |  0 |  0 |  0 |  0 |  0 |  0 |  0 | 0 |             0. |             0. |
|  0 |  1 |  1 |  2 |  0 |  0 |  0 |  0 |  0 | 0 | -1.6271778e-15 | -1.6271778e-15 |
|  0 |  0 |  1 |  0 |  0 |  2 |  1 |  0 |  0 | 2 |             2. |             0. |
|  0 |  1 |  0 |  2 |  0 |  0 |  0 |  0 |  1 | 1 |             1. |             0. |
|  4 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 | 4 |             4. |             0. |
|  0 |  0 |  4 |  0 |  0 |  0 |  0 |  0 |  0 | 0 | -3.9612421e-14 | -3.9612421e-14 |
|  0 |  0 |  0 |  4 |  0 |  0 |  0 |  0 |  0 | 0 |  1.6551855e-14 |  1.6551855e-14 |
|  0 |  0 |  0 |  0 |  4 |  0 |  0 |  0 |  0 | 0 |             0. |             0. |
|  0 |  1 |  0 |  1 |  0 |  0 |  0 |  1 |  1 | 3 |             3. |             0. |
|  1 |  2 |  1 |  0 |  0 |  0 |  0 |  0 |  0 | 1 |             1. |             0. |
|  0 |  0 |  0 |  0 |  0 |  0 |  4 |  0 |  0 | 0 |  3.0992408e-14 |  3.0992408e-14 |
|  0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  4 | 4 |             4. |             0. |
#+TBLFM: $11=$1 - 9.90310521096e-15*$3 + 4.13796369376e-15*$4 + $6 + 7.74810196662e-15*$7 + 2.*$8 + $9::$12=$11-$10

Prediction is perfect. We can round the formula:
: $1 + $6 + 2.*$8 + $9

- $1 is a0, digit 0, which counts for 1
- $6 is a6, digit 6, which counts for 1
- $8 is a8, digit 8, which counts for 2
- $9 is a9, digit 9, which counts for 1

So, orgtbl-fit discovered that only digits 0, 6, 8, 9 count. Other
digits can be discarded. Those are digits with "holes"
So the answer is 2581 = 2, because there a 2 holes.

* Best teacher?
model = ? +?*theo +?*theo^2 +?*duration +?* duration^2 +?*theo*duration
-------------------------(v)
|  theo | duration | quizzresult |  Best Fit |   Fit Diff |
|-------+----------+-------------+-----------+------------|
| 0.781 |     18.0 |        30.3 | 31.421868 |   1.121868 |
| 0.615 |     38.3 |         5.2 | 5.4007251 |  0.2007251 |
| 0.601 |      5.2 |        52.5 | 51.291140 |   -1.20886 |
| 0.176 |      4.4 |        60.4 | 59.521228 |  -0.878772 |
| 0.428 |     40.9 |        10.5 | 11.333044 |   0.833044 |
| 0.255 |     12.2 |        66.2 | 67.268743 |   1.068743 |
| 0.784 |     12.6 |        34.2 | 34.277735 |   0.077735 |
| 0.468 |      5.4 |        58.1 | 59.604336 |   1.504336 |
| 0.475 |     37.6 |        19.8 | 20.199134 |   0.399134 |
| 0.605 |     22.5 |        47.5 | 46.205916 |  -1.294084 |
| 0.319 |     24.8 |        58.7 | 58.571821 |  -0.128179 |
| 0.713 |     30.1 |        19.2 | 19.094910 |   -0.10509 |
| 0.596 |     36.0 |        15.6 | 15.262959 |  -0.337041 |
| 0.659 |     21.8 |        42.5 | 41.805969 |  -0.694031 |
| 0.731 |     19.6 |        36.2 | 36.265889 |   0.065889 |
| 0.309 |     44.0 |         4.9 | 4.2745824 | -0.6254176 |
#+TBLFM: $4=41.310831661 + 86.6227413961*$1 - 134.496123584*$1^2 + 2.04949509715*$2 - 0.067672358144*$2^2 - 0.744700713305*$2*$1::$5=$4-$3
